notebook_vr5/app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "contacts" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @contacts = Contact.order(:name).page(params[:page]).per(10)

INSERT INTO "contacts" ("name", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Vanessa"], ["email", "vanessa@gmail.com"], ["kind_id", 2], ["rmk", "Minha mana."], ["created_at", 2017-03-21 01:29:56 UTC], ["updated_at", 2017-03-21 01:29:56 UTC]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "kind_id" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["kind_id", 3], ["updated_at", 2017-03-21 01:30:06 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)

DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 62]]
---
  def destroy
    @contact.destroy

SELECT "kinds".* FROM "kinds"
---
    def set_options_for_select
      @kind_options_for_select = Kind.all

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 62], ["LIMIT", 1]]
---
    def set_contact
      @contact = Contact.find(params[:id])