notebook_RoR_4_Heroku/app/controllers/contacts_controller.rb

  def index
    @contacts = current_user.contacts.order(:name).page(params[:page]).per(10)
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."user_id" = ?  ORDER BY "contacts"."name" ASC LIMIT 10 OFFSET 0  [["user_id", 1]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "contacts"  WHERE "contacts"."user_id" = ? LIMIT 10 OFFSET 0) subquery_for_count  [[nil, 1]]

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("created_at", "email", "kind_id", "name", "rmk", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2017-03-31 17:46:16.162444"], ["email", "wererer"], ["kind_id", 1], ["name", "erere"], ["rmk", "eeeererer"], ["updated_at", "2017-03-31 17:46:16.162444"]]

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = ?, "updated_at" = ? WHERE "contacts"."id" = 103  [["name", "erererere"], ["updated_at", "2017-03-31 17:53:27.739067"]]

  def destroy
    @contact.destroy
---
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 45]]

    def set_options_for_select
      @kind_options_for_select = Kind.all
---
SELECT "kinds".* FROM "kinds"

    def set_contact
      @contact = current_user.contacts.find(params[:id])
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."user_id" = ? AND "contacts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 45]]