notebook_RoR_4_Heroku/app/controllers/kinds_controller.rb

SELECT "kinds".* FROM "kinds"
---
  def index
    @kinds = Kind.all

INSERT INTO "kinds" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", "2017-03-31 18:07:51.845357"], ["description", "Teste"], ["updated_at", "2017-03-31 18:07:51.845357"]]
---
  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save

UPDATE "kinds" SET "description" = ?, "updated_at" = ? WHERE "kinds"."id" = 4  [["description", "Testeeeee"], ["updated_at", "2017-03-31 18:08:04.868186"]]
---
  def update
    respond_to do |format|
      if @kind.update(kind_params)

DELETE FROM "kinds" WHERE "kinds"."id" = ?  [["id", 4]]
---
  def destroy
    @kind.destroy

SELECT  "kinds".* FROM "kinds"  WHERE "kinds"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_kind
      @kind = Kind.find(params[:id])