app/views/contacts/_form.html.erb

      <div class="col-sm-3">
        <%= address_fields.select :state, options_for_states(@contact.address.state), {}, {:class => "form-control"} %>
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."contact_id" = ? LIMIT ?  [["contact_id", 1], ["LIMIT", 1]]